<html>
<head>
<title>Fenster zum Bilder einf&uuml;gen</title>
<link rel="stylesheet" type="text/css" href="../../styles/help.css"/>
</head>
<body>

<div class="main">
	
  <div class="title">Fenster zum Bilder einf&uuml;gen</div>
	<div class="content"> 
	  
    <p>Nach dem Dr&uuml;cken der Schaltfl&auml;che &quot;Bild einf&uuml;gen&quot; 
      wird von KTML ein Fenster angezeigt, das Ihnen hilft, ein vorhandenes Bild 
      auszuw&auml;hlen, oder ein Bild hochzuladen.</p>
	  <p><strong>Navigation in dem Dateifeld</strong><br>
	  Das Fenster besitzt einen Dateibrowserbereich und einen Konfigurationsbereich.
	     Es werden vom Bildbrowser nur folgende Dateien unterst&uuml;tzt:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        <strong>bmp</strong>, <strong>gif</strong>, <strong>jpeg</strong>, <strong>jpg</strong>, <strong>png</strong>, <strong>swf</strong>.</p>
	  <p>        Der Dateibrowser hat folgende Optionsbereiche:</p>
	  <ul>
	  <li>Das linke Panel mit der Ordnerstruktur, folgende Optionen stehen zur 
        Auswahl: <strong>Ordner erstellen, Ordner l&ouml;schen</strong>.
	    <p><img src="../images/folders.gif" width="105" height="45" border="1"></p>	  </li>
	  <li>Das rechte Pane zeigt den Inhalt des ausgew&auml;hlten Ordners an, folgende 
        Optionen stehen zur Auswahl: <strong>Bild hochladen, Bild l&ouml;schen</strong>.<br>
        <p><img src="../images/images.gif" width="207" height="21" border="1"></p>	  </li>
	  </ul>
	  <p>
        Der Dateibrowser zeigt nur den Inhalt des &quot;Uploadordners&quot;, Sie k&ouml;nnen
      beim Einrichten des KTML Editors den Pfad dieses Ordners angeben.</p>
	  
    <p> Sie k&ouml;nnen im Dateibrowser auch die einzelnen Ordner (falls erstellt) 
      durchsuchen, um einen Ordner einzusehen brauchen Sie nur doppelt auf das 
      Ordnersymbol klicken, um den Ordner aufzurufen, und Unterordner anzuzeigen.<br>
      Im rechten Panel werden die Unterordner und die Bilder mit Namen und einer 
      Voransicht angezeigt. Um ein Bild auszuw&auml;hlen, brauchen Sie nur die 
      Voransicht oder den Namen anklicken.</p>
	  <p><strong>Die Bildfunktionen</strong><br>
      Nach dem Markieren des Bildes wird im unteren Panel dessen Eigenschaften 
      angezeigt. Die Eigenschaften k&ouml;nnen im unteren Panel ge&auml;ndert 
      werden.<br><br>
      <img src="../images/image_insert_conf.gif" width="335" height="157" border="1">	  </p>
	  
    <p>F&uuml;r das gew&auml;hlte Bild stehen folgende Optionen zur verf&uuml;gung:</p>
	  <ul>
	  <li><strong> Ganze URL</strong> &#8211; die Alternative zum Dateibrowser 
        ist das Eingabefeld f&uuml;r die ganze URL des Bildes. Es wird automatisch 
        beim Ausw&auml;hlen des Bildes angezeigt.Sie k&ouml;nnen nat&uuml;rlich 
        auch ein externes Bild von einem anderen Server in dieser URL eingeben, 
        beachten Sie jedoch, dass KTML keinen Einfluss auf externe Bilder hat.</li>
	  <li> <strong>Alternativer Text </strong>&#8211; Dieser Text wird bei Browsern, 
        die keine Bildunterst&uuml;tzung haben, angezeigt. Bei den meisten Browsern 
        wird der Text auch als Popup-Text &uuml;ber dem Bild angezeigt.</li>
	  <li> <strong>Ausrichtung</strong> &#8211; spezifiziert die allgemenie Position 
        des Bildes relativ zu den anderen Objekten im Fenster. Die w&auml;hlbaren 
        Optionen bestehen aus: Vorgegeben, Links, Rechts, Oben, Mitte, Unten; 
        eine genauere Positionierung des Bildes k&ouml;nnen Sie mit Tabellen erreichen.</li>
	  <li> <strong>Rahmenst&auml;rke</strong> &#8211; w&auml;hlen Sie einen Wert 
        in Pixel, um einen Rahmen um das Bild zu ziehen. Der vorgegenbene Wert 
        ist &quot;0&quot; das hei&szlig;t, da&szlig; kein Rahmen angezeigt wird.</li>
	  <li> <strong>Breite &amp; H&ouml;he</strong> &#8211; Die Dimensionen des 
        Bildes. Um die Orginalgr&ouml;&szlig;e des Bildes beizubehalten, lassen 
        Sie die Felder auf den vorgegebenen Wert. Sie k&ouml;nnen das Bild auch 
        im Editor ver&auml;ndern, einfach das Bild markieren und mit der Maus 
        ziehen. Es ist jedoch empfohlen, das Bild zuerst in der richtigen Gr&ouml;&szlig;e 
        auf den Server zu laden, ansonsten k&ouml;nnen kleine Bilder zu einer 
        unn&ouml;tig langen Ladezeit f&uuml;hren.</li>
  </ul>
	  <p>        Diese Eigenschaften k&ouml;nnen auch sp&auml;ter im Eigenschaftsfeld ge&auml;ndert
	    werden.<br><br>
      <font size="2"> <strong>Notiz </strong>Sie k&ouml;nnen das Bild auch vergr&ouml;&szlig;ern, 
      es wird aber die Bildqualit&auml;t darunter leiden. Auch hier ist empfohlen, 
      das Bild in dieser Gr&ouml;&szlig;e auf den Server zu laden.</font></p>
	  
    <p>Um das Bild einzuf&uuml;gen brauchen Sie nur OK zu dr&uuml;cken.</p>
	  <p><strong>Einen Neuen Ordner anlegen</strong><br>
      Sie k&ouml;nnen, um die Bilder besser zu organisieren, auch neue Ordner 
      anlegen. Klicken Sie einfach auf den &quot;Ordner erstellen&quot;-Button.<br>
      Der neue Ordner wird automatisch im Ordnerverseichnis (links) angezeigt.</p>
	  <p><strong>Ordner l&ouml;schen</strong><br>
      Sie k&ouml;nnen bestehende Ordner auch l&ouml;schen, wenn Sie dies tun wird 
      ein seperates Fenster angezeigt. <strong>Vorsicht:</strong> der Inhalt des 
      Ordners wird dabei unwideruflich gel&ouml;scht.<br>
      </p>
  </div>
</div>
<div class="footer">
	<input type="button" class="ktml_button" value="Schlie&szlig;en" onclick="window.close()"/>
</div>

</body>
</html>
