<html>
<head>
<title>Rechtschreibpr&uuml;fung</title>
<link rel="stylesheet" type="text/css" href="../../../../styles/help.css"/>
</head>
<body>

<div class="main">
	
  <div class="title">Rechtschreibpr&uuml;fung</div>
	<div class="content"><img src="../img/speller.gif" width="344" height="259" border="1"> <br>
    Die KTML3 Rechtschreibkorrektur erm&ouml;glicht es, Benutzern die Rechtschreibung 
    ihres Dokumentes zu &uuml;berpr&uuml;fen. Es k&ouml;nnen einzelne W&ouml;rter 
    sowie auch alle falsch geschriebnen W&ouml;rter ersetzt werden.<br>
	  <p><strong>Nicht im W&ouml;rterbuch</strong><br>
      Dieses Feld erscheint, wenn das zu pr&uuml;fende Wort nicht im W&ouml;rterbuch 
      enthalten ist. Das Feld ist inaktiv und kann auch nicht vom Benutzer ge&auml;ndert 
      werden.</p>
	  <p><strong>Ersetzen durch</strong><br>
      Dieses Textfeld zeigt die Optionen f&uuml;r das falsch geschrieben Wort 
      an. Der erste Wert ist der, den der Rechtschreibpr&uuml;fer als erstes im 
      W&ouml;rterbuch findet. Um diesen Wert zu &auml;ndern, k&ouml;nnen Sie aus 
      den noch vorgeschlagenen W&ouml;rter w&auml;hlen.</p>
	  <p><strong>Vorschl&auml;ge</strong><br>
      Dieses Feld zeigt sehr &auml;hnliche W&ouml;rter f&uuml;r das ersetzen des 
      Falsch geschiebenen Wortes (z.B.: Deutsch = Daitsch). Sie k&ouml;nnen am 
      rechten Rand der Liste in den Eintr&auml;gen navigieren. Um einen Auswahl 
      zu machen, klicken Sie auf ein Wort, es wird dann automatisch im &quot;Nicht 
      im W&ouml;rterbuch&quot; Feld eingef&uuml;gt.</p>
	  <p><strong>Sprache</strong><br>
      Sie k&ouml;nnen die Sprache mithilfe diese Menu's w&auml;hlen. Die vorgegeben 
      Sprache ist gleich der KTML Sprache, die beim Einf&uuml;gen der KTML Funktion 
      verwendet wurde.</p>
	  
    <p>Wenn eine andere Sprache gew&auml;hlt ist, ladet KTML die Seite neu. Diese 
      Option ist abh&auml;ngig von der Verbindungsgeschwindigkeit, sollte es nicht 
      aktualisiert werden, ist die Seite wahrscheinlich in einer tempor&auml;ren 
      Schleife (dr&uuml;cken Sie &quot;STRG+F5&quot; zum Aktualisieren).</p>
	  
    <p>Bei jeder &Auml;nderung der Sprache wird die Seite neu eingeladen, es ist 
      auch nicht m&ouml;glich, in einem KTML Feld mehrere Sprachen zu &uuml;berpr&uuml;fen.</p>
	  <p><strong>Ignorieren</strong><br>
      Dieser Befehl ignoriert das nicht erkannte Wort einmal.</p>
	  <p><strong>Alles Ignorieren</strong><br>
      Dieser Befehl ignoriert alle selben nicht erkannten W&ouml;rter in diesem 
      Dokument.</p>
	  <p><strong>Dem W&ouml;rterbuch hinzuf&uuml;gen</strong><br>
      Dieser Befehl erlaubt dem Benutzer, ein Wort in das W&ouml;rterbuch einzuf&uuml;gen. 
      Meistens gebr&auml;uchlich bei folgenden Arten von W&ouml;rtern (Produkten, 
      Firmennamen, Software Anwendungen, etc). Nach dem Einf&uuml;gen in das W&ouml;rterbuch 
      wird zum n&auml;chsten nichterkannten Wort gewechselt.</p>
	  <p><strong>&Auml;ndern</strong><br>
	    Ersetzt das falschgeschriebene Wort durch den Vorschlag im &quot;Ersetzen
	      durch&quot; Feld.</p>
	  <p><strong>Alles &Auml;ndern</strong><br>
      Dieser Befehl ersetzt alle gleich-falschgeschriebene W&ouml;rter automatisch.</p>
  </div>
</div>
<div class="footer">
	<input type="button" class="ktml_button" value="Schlie&szlig;en" onclick="window.close()"/>
</div>

</body>
</html>
