<html>
<head>
<title>Tabellenoptionen</title>
<link rel="stylesheet" type="text/css" href="../../../../styles/help.css"/>
</head>
<body>

<div class="main">
	<div class="title">Tabellenoptionen</div>
  <div class="content"> 
    <p>Wenn im KTML-Editor eine Spalte innerhalb der Tabelle ausgew&auml;hlt ist, 
      erscheint der Zellen-Inspektor (in der Optionenleiste kann auch &lt;td&gt; 
      angeklickt werden). Neben Zellenoptionen kann dieser Inspektor auch eine 
      F&uuml;lle von anderen Tabellenoptionen bearbeiten.</p>
      <img src="../img/colspan.gif" width="105" height="49" border="1"> 
	 
	    
    <p><strong>Einzelne Spalten vergr&ouml;&szlig;ern</strong><br>
    Klicken Sie auf die Schaltfl&auml;che &quot;Spaltenvergr&ouml;&szlig;erung&quot;, 
    um die Spalte zu vergr&ouml;&szlig;ern. Jeder Klick verg&ouml;&szlig;ert die 
    Spaltenbreite.</p>
    <p><strong>Spalten einr&uuml;cken</strong><br>
    Der Zellenabstand wird bei jedem Klick um eine Zellenbreite einger&uuml;ckt. 
    Ist die Tabelle nur eine Spalte breit und Sie ben&uuml;tzen diesen Befehl, 
    erscheint folgende Fehlermeldung: &#8220;Zelle kann nicht verkleinert werden&#8221;.	
    </p>
    <p><strong>Einzelne Reihen vergr&ouml;&szlig;ern</strong><br>
      Klicken Sie auf die Schaltfl&auml;che &quot;Reihenvergr&ouml;&szlig;erung&quot;, 
      um die Reihe zu vergr&ouml;&szlig;ern. Jeder Klick verg&ouml;&szlig;ert 
      die Reihe.</p>
    <p><strong>Reihe einr&uuml;cken</strong><br>
      Der Zellenabstand wird bei jedem Klick um eine Zellenh&ouml;he einger&uuml;ckt. 
      Ist die Tabelle nur eine Reihe hoch und Sie ben&uuml;tzen diesen Befehl, 
      erscheint folgende Fehlermeldung: &#8220;Zelle kann nicht verkleiner werden 
      &#8221;.</p>
    <p><strong>Spalte einf&uuml;gen</strong><br>
      Ein weiters Hightlight von KTML ist die M&ouml;glichkeit bei einer Tabelle, 
      weitere Spalten einzuf&uuml;gen. Plazieren Sie die Textmarke in einer Zelle 
      und dr&uuml;cken Sie diese Schaltfl&auml;che, um linksgerichtet eine Spalte 
      einzuf&uuml;gen.</p>
    <p><strong>Spalte l&ouml;schen</strong><br>
      Sie k&ouml;nnen auch eine existierende Spalte in einer Tabelle l&ouml;schen. 
      Markieren Sie diese Spalte und dr&uuml;cken auf die Schaltfl&auml;che &quot;Spalte 
      l&ouml;schen&quot;, um diesen Befehl auszuf&uuml;hren.</p>
    <p><strong>Reihe einf&uuml;gen</strong><br>
      Der Befehl ist sehr &auml;hnlich mit dem Befehl &quot;Spalte einf&uuml;gen&quot;. 
      Plazieren Sie die Textmarke in einer Zelle und dr&uuml;cken Sie die Schaltfl&auml;che, 
      um unterhalb der Auswahl eine Reihe einzuf&uuml;gen.</p>
    <strong>Reihe l&ouml;schen</strong><br>
    Sie k&ouml;nnen auch eine existierende Reihe in einer Tabelle l&ouml;schen. 
    Markieren Sie diese Reihe und dr&uuml;cken auf die Schaltfl&auml;che &quot;Reihe 
    l&ouml;schen&quot;, um diesen Befehl auszuf&uuml;hren. 
  </div>
</div>
<div class="footer">
	<input type="button" class="ktml_button" value="Schlie&szlig;en" onclick="window.close()"/>
</div>

</body>
</html>
